#![allow(unused_imports, uncommon_codepoints, dead_code)]

mod momentkh;

use chrono::{NaiveDate, Datelike};
use momentkh::{parse_iso_date, KhmerDate, LunarDate, LunarDay, LunarMonth, MoonStatus, សុរិយាត្រឡើងស័ក, គណនាឆ្នាំចុល្លសករាជថ្មីក្នុងគ្រិស្តសករាជ, Time};

fn main() {
    let _សុរិយាត្រឡើងស័ក = សុរិយាត្រឡើងស័ក::from_jolasakrach(គណនាឆ្នាំចុល្លសករាជថ្មីក្នុងគ្រិស្តសករាជ(1896));
    println!("{:?} ---- {:?}", _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(362), _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(362).គណនាសម្ពោធព្រះអាទិត្យ());
    println!("{:?} ---- {:?}", _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(363), _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(363).គណនាសម្ពោធព្រះអាទិត្យ());
    println!("{:?} ---- {:?}", _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(364), _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(364).គណនាសម្ពោធព្រះអាទិត្យ());
    println!("{:?} ---- {:?}", _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(365), _សុរិយាត្រឡើងស័ក.គណនាមធ្យមព្រះអាទិត្យ(365).គណនាសម្ពោធព្រះអាទិត្យ());
    println!("New year {:?}", _សុរិយាត្រឡើងស័ក.គណនាឈ្មោះថ្ងៃឡើងស័ក());
    println!("New year {:?}", _សុរិយាត្រឡើងស័ក.គណនាថ្ងៃឡើងស័ក());
    println!("New year {:?}", _សុរិយាត្រឡើងស័ក.គណនាថ្ងៃចូលឆ្នាំ());
    println!("New year {:?}", _សុរិយាត្រឡើងស័ក.គណនាវេលាចូលឆ្នាំ());
    println!("New year {:?}", _សុរិយាត្រឡើងស័ក.គណនាវេលាចូលឆ្នាំ().gregorian_date.weekday());
    // let some_day = parse_iso_date("1996-9-24").expect("Cannot parse date");
    // println!("{:?}", KhmerDate::from_naive_date_time(some_day, Some(Time {hour: 13, minute: 36})));

    // println!("{:?}", EXCLUSION);

    // println!("{:?}", សុរិយាត្រឡើងស័ក::from_jolasakrach(គណនាឆ្នាំចុល្លសករាជថ្មីក្នុងគ្រិស្តសករាជ(1896)).គណនាឈ្មោះថ្ងៃឡើងស័ក());
    // println!("{:?}", សុរិយាត្រឡើងស័ក::from_jolasakrach(គណនាឆ្នាំចុល្លសករាជថ្មីក្នុងគ្រិស្តសករាជ(1896)).គណនាថ្ងៃឡើងស័ក());
    // println!("{:?}", សុរិយាត្រឡើងស័ក::from_jolasakrach(គណនាឆ្នាំចុល្លសករាជថ្មីក្នុងគ្រិស្តសករាជ(1896)).គណនាថ្ងៃចូលឆ្នាំ());
    
    // println!(
    //     "{:?}",
    //     KhmerDate::from_khmer_date_time(
    //         2566,
    //         LunarDate {
    //             day: LunarDay {
    //                 order: 6,
    //                 moon_status: MoonStatus::កើត
    //             },
    //             month: LunarMonth::ផល្គុន,
    //         },
    //         None,
    //     )
    // );
}
